import { ReactElement } from 'react';

import { AuthTermsBase } from '~/components/auth/styled';
import Header from '~/components/header';

const Privacy = () => {
  return (
    <AuthTermsBase>
      {`개인정보 처리 방침
최종 개정 : 2022년 7월

고고(GOGO)는 개인정보 보호법 제30조에 따라 정보주체(고객)의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립·공개합니다.
고고는 서비스 기획부터 종료까지 개인정보보호법 등 국내의 개인정보 보호 법령을 철저히 준수합니다.

제 1조 (개인정보의 처리목적)
고고는 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.
- 고객 가입의사 확인, 고객에 대한 서비스 제공에 따른 본인 식별.인증, 회원자격 유지.관리

제2조 (개인정보의 처리 및 보유기간)
 1) 고고는 정보주체로부터 개인정보를 수집할 때 동의 받은 개인정보 보유.이용기간 또는 법령에 따른 개인정보 보유.이용기간 내에서 개인정보를 처리·보유합니다.
 2) 구체적인 개인정보 처리 및 보유 기간은 다음과 같습니다.
- 고객 가입 및 관리 : 서비스 이용계약 또는 회원가입 해지 시까지

제3조 (개인정보의 제3자 제공)
고고는 정보주체의 별도 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조에 해당하는 경우 외에는 개인 정보를 제3자에게 제공하지 않습니다.

제4조 (정보주체와 법정대리인의 권리.의무 및 행사방법)
정보주체는 고고에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
1. 개인정보 열람요구
2. 개인정보에 오류 등이 있을 경우 정정 요구
3. 삭제요구
4. 처리정지 요구

제5조 (처리하는 개인정보 항목)
고고는 다음의 개인정보 항목을 처리하고 있습니다.
- (필수) 산타 회원 가입 시 : 이메일주소, 비밀번호, 닉네임

제6조 (자신의 개인정보 열람, 정정 및 삭제)
정보주체는 고고에 대해 언제든지 다음 각호의 개인정보 보호 관련 권리를 행사할 수 있습니다.
 1) 개인정보 열람요구
 2) 오류 등이 있을 경우 정정 요구
 3) 삭제요구
 4) 처리정지 요구

정보주체는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 권리를 행사하실 수 있습니다. 이 경 우 [개인정보보호법] 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.

정보주체가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우 고고는 정정 또는 삭제를 완료할 때까지 당 해 개인정보를 이용하거나 제공하지 않습니다.

계정 및 아이디는 이용약관에 따라 수정에 제한이 있을 수 있습니다.

제7조 (개인정보의 보유기간 및 이용기간)
이용자의 동의하에 수집된 개인정보는 회원자격이 유지되는 동안 보유 및 이용되며, 해지를 요청하는 경우에는 재생이 불가능한 방법에 의해 파기됩니다. 단, 상법 및 전자상거래 등에서의 소비자보호에 관한 법률 등에 근거하 여 거래관련 권리 의무 관계를 확인할 필요가 있거나 기타 관련 법률을 이유로 일정기간 보유하여야 할 필요가 있 을 경우에는 일정기간 보유합니다.

* 전자상거래 등에서의 소비자보호에 관한 법률
(1) 계약 또는 청약철회 등에 관한 기록: 5년
(2) 대금결제 및 재화 등의 공급에 관한 기록: 5년
(3) 소비자의 불만 또는 분쟁처리에 관한 기록: 3년

* 통신비밀보호법
(4) 웹사이트 방문기록 (로그인 기록) : 3개월
(5) 관계법령이나 고고의 서비스 이용약관을 위반한 불량 이용자에 관한 기록: 1년

제8조 (개인정보 파기절차 및 방법)
이용자의 개인정보는 아래의 기준에 의해 관리됩니다.

1. 파기대상
 1) 수집 및 이용목적이 달성되거나, 보유 및 이용기간이 경과된 개인정보
 2) 고고의 서비스를 1년 동안 이용하지 않는 이용자의 개인정보
 3) 법령에서 별도의 기간을 정하고 있는 경우 해당 법령에서 정한 기간이 경과한 개인정보

2. 파기절차
이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 내부 방침 및 기타 관련 법령에 의한 보관 기간 동 안 저장된 후 지체 없이 파기됩니다. 고고의 서비스를 1년 동안 이용하지 않는 이용자의 개인정보 중 서비스 재이 용을 위해 필요한 최소한의 정보는 다른 이용자의 개인정보와 분리되어 별도로 저장‧관리되며, 서비스를 마지막으 로 이용한 시점에서 5년이 경과되면 파기됩니다. 단, 개인정보를 별도로 저장‧관리하는 경우에는 관계법령에 특별 한 규정이 있는 경우를 제외하고는 해당 개인정보를 이용하거나 제공하지 않습니다.

3. 파기방법
 1) 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기됩니다.
 2) 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

제9조 (개인정보 자동 수집 장치의 설치∙운영 및 거부에 관한 사항)
 1) 서비스 이용 과정에서 IP 주소, 쿠키, 서비스 이용 기록, 기기정보, 위치정보가 생성되어 수집될 수 있습니다.
가. 서비스 이용 과정에서 이용자에 관한 정보를 자동화된 방법으로 생성하여 이를 저장(수집)하거나, 이용자 기기의 고유한 정보를 원래의 값을 확인하지 못하도록 안전하게 변환하여 수집합니다.
나. 서비스 이용 과정에서 위치기반 서비스의 목적으로 위치정보가 수집될 수 있습니다.
다. 이와 같이 수집된 정보는 개인정보와의 연계 여부 등에 따라 개인정보에 해당할 수 있고, 개인정보에 해당하지 않을 수도 있습니다.

제10조 (이용자의 권리와 의무)
이용자의 개인정보를 최신의 상태로 정확하게 입력하여 불의의 사고를 예방해 주시기 바랍니다. 이용자가 입력한 부정확한 정보로 인해 발생하는 사고의 책임은 이용자에게 있으며 타인 정보의 도용 등 허위정보를 입력할 경우 서비스의 이용이 제한될 수 있습니다.
이용자는 개인정보를 보호 받을 권리를 보유하나 이와 동시에 이용자의 정보를 스스로 보호하고 또한 타인의 정보 를 침해하지 않을 의무도 가지고 있습니다. 비밀번호를 포함한 이용자의 개인정보가 유출되지 않도록 조심하시고 게시물을 포함한 타인의 개인정보를 훼손하지 않도록 유의해 주십시오.. 만약 이 같은 책임을 다하지 못하고 타인 의 정보 및 존엄성을 훼손할 시에는 [개인정보보호법] 및 [정보통신망이용촉진및정보보호등에관한법률]등에 의해 처벌 받을 수 있습니다.

제 11조 (의견수렴 및 불만처리)
고고는 이용자의 의견을 소중하게 생각합니다.
문의사항은 구글폼(https://forms.gle/iF39Su1Jy7DDS557A)으로 접수하여 주십시오. 접수 후, 최단 시간 내에 성실하게 답변해 드리겠습니다.`}
    </AuthTermsBase>
  );
};

export default Privacy;

Privacy.getLayout = function getLayout(page: ReactElement) {
  return (
    <>
      <Header title="개인정보 처리방침" />
      {page}
    </>
  );
};
