import { ReactElement } from 'react';

import { AuthTermsBase } from '~/components/auth/styled';
import Header from '~/components/header';

const Service = () => {
  return (
    <AuthTermsBase>
      {`제1장 총칙
제1조 (목적)
이 약관은 고고(GOGO)(이하 “회사”라 합니다)가 제공하는 서비스의 이용과 관련하여 회사와 이용자 간의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

제2조 (용어의 정의)
본 약관에서 사용하는 용어의 정의는 본 조에서 정하는 것을 제외하고는 관계 법령 및 개인정보처리방침, 서비스별 안내에서 정하는 바에 의합니다.

가. “서비스”는 구현되는 기기(PC, 스마트폰 등의 각종 유무선 장치를 포함합니다)와 무관하게 회사가 개발한 고고 앱을 통해 이용자에게 제공하는 고고 서비스를 말합니다.
나. “이용자”는 회사의 이 약관에 따른 계약을 체결하여 서비스를 이용하는 자로서 다음 각 호와 같이 구분됩니다.
 1) “회원”은 회사가 정한 회원 가입 절차를 거쳐 서비스를 이용하는 자를 말합니다.
 2) “비회원”은 회원가입 절차 없이 서비스를 이용하는 자를 말합니다. 단, 비회원 이용자는 회원에 비하여 서비스 이용에 있어 일부 제한이 있을 수 있습니다.
다. “아이디”는 회원의 식별 및 서비스 이용을 위하여 회원이 가입 시 선정하고 회사가 승인하는 이메일 주소 형식의 문자 또는 숫자, 기호의 조합을 의미합니다.
라. “비밀번호”는 회원이 부여받은 아이디와 일치하는 회원임을 확인하기 위하여 회원 자신이 정한 문자 또는 숫자, 기호의 조합을 의미합니다.
마. “개인위치정보주체”는 자신의 위치정보 공개에 동의한 “회원”을 말합니다.
바. “위치정보이용자”는 “개인위치정보주체”를 말합니다.
사. “게시물”이라 함은 “회원”이 “서비스”를 이용함에 있어 “서비스상”에 게시한 서비스와 관련한 각종 이미지, 텍스트 정보, 관련 자료 및 정보 등을 말합니다.

제3조 (약관의 효력 및 변경)
1. 약관은 서비스를 이용하는 모든 이용자에 대하여 효력이 있습니다. 다만, 비회원의 경우 약관이 정한 바에 따라 일부 조항의 적용이 배제될 수 있습니다.
2. 이 약관은 이용자가 회사로부터 약관에 동의하여 회사와 이용계약을 체결한 날로부터 이용계약을 해지하는 시점까지 적용되는 것을 원칙으로 합니다. 다만, 이 약관의 일부 조항은 약관의 적용이 종료한 이후에도 효력이 계속될 수 있습니다.
3. 회사는 서비스에 새로운 업무 적용, 정부에 의한 시정명령의 이행 및 기타 회사의 업무상 약관변경이 필요하다고 판단될 경우 본 약관을 변경할 수 있습니다.

제4조 (관계 법령의 적용)
1. 본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.
2. 회사는 필요한 경우 특정 서비스에 관하여 적용될 사항 및 세부이용지침을 정하여 이를 공지할 수 있습니다.
3. 본 약관과 관련해 회사의 정책변경, 법령의 제·개정 또는 공공기관의 고시나 지침 등에 의하여 회사가 서비스 내 공지사항 등을 통해 공지하는 내용도 이용계약의 일부를 구성합니다.


제2장 계약체결 및 해지
제5조 (이용계약 체결)
1. 이용계약은 “회원”이 되고자하는 자(이하 “가입신청자”)가 약관의 내용에 대해 동의를 한 다음 회원가입신청을 하고 “회사”가 이러한 신청에 대해 승낙함으로써 체결됩니다.
2. 개인위치정보를 사용하는 서비스 이용을 위해 “개인위치정보 수집 및 이용약관”에 동의해야 합니다.
3. 회사는 “가입신청자”의 신청에 대해 서비스이용을 승낙함을 원칙으로 합니다. 다만, 회사는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
 1)가입신청자가 이 약관에 의해 이전에 회원자격을 상실한 적이 있는 경우.
 2)실명이 아니거나 타인의 명의를 이용한 경우
 3)허위정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우
 4)가입신청자의 귀책사유로 인해 승인이 불가능하거나 기타 규정한 제반사항을 위반해 신청하는 경우
4. 회사는 서비스관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
5. 제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, 회사는 원칙적으로 이를 가입신청자에게 알리도록 합니다.
6. 이용계약의 성립 시기는 회사가 가입완료를 신청절차상에서 표시한 시점으로 합니다.

제6조 (회원정보의 변경)
1. 회원은 개인정보관리화면을 통해 언제든지 본인의 개인정보(닉네임, 비밀번호 등) 를 열람하고 수정할 수 있습니다. 다만, 서비스관리를 위해 필요한 이메일계정 등은 수정이 불가능합니다.
2. 회원은 회원가입신청 시 기재한 사항이 변경되었을 경우 올라인으로 수정을 하거나 전자우편 기타 방법으로 회사에 대해 그 변경사항을 알려야 합니다.
3. 제2항의 변경사항을 회사에 알리지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.

제7조 (개인정보 보호의무)
회사는 “정보통신망법” 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 회사의 개인정보취급방침이 적용됩니다. 다만, 회사의 공식 서비스 이외의 링크된 사이트에서는 회사의 개인정보취급방침이 적용되지 않습니다.

제8조 (회원의 닉네임, 아이디, 비밀번호의 관리에 대한 의무)
1. 회사의 고의로 인해 비밀번호가 유출된 경우를 제외하고 회원의 닉네임, 아이디, 비밀번호에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안됩니다.
2. 회사는 회원의 닉네임 및 아이디가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 회사 및 회사의 운영자로 오인한 우려가 있는 경우, 해당 닉네임 및 아이디의 이용을 제한할 수 있습니다.
3. 회원은 이메일 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우 이를 즉시 회사에 통지하고 비밀번호를 변경하여야 하며 회사는 즉시 종전의 비밀번호에 의한 서비스 이용을 중단하고 필요한 안내를 해야합니다.
4. 제3항의 경우에 해당 회원이 회사에 그 사실을 통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대해 회사는 책임지지 않습니다.

제9조 (“회원”에 대한 통지)
1. 회사가 회원에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 이메일, 앱 푸쉬 등으로 할 수 있습니다.
2. 회사는 회원 전체에 대한 통지의 경우 7일 이상 공지사항에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.

제10조 (계약의 해지)
1. 이용자는 언제든지 회사와의 이용계약을 해지할 수 있으며, 회사는 이용자의 해지 요청이 있는 경우 지체 없이 그에 따른 조치를 취하여야 합니다.
2. 회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸됩니다.


제3장 서비스의 이용
제11조 (“서비스”의 내용)
1. 회사가 제공하는 서비스의 내용은 다음 각 호와 같습니다.
 1) 날씨정보제공 서비스
 2) 등산기록 서비스
 3) 특정 키워드 검색 및 필터링으로 관련등산정보 제공
 4) 유튜브나 브런치 등을 통해 이용자에게 콘텐츠를 제공하는 일체의 서비스
 5) 코스 즐겨찾기 기능
2. 회사는 위치정보사업자로부터 제공받은 위치정보수집대상의 위치정보 및 상태 정보를 이용하여 다음과 같은 내용으로 서비스합니다.
 1) 위치정보수집대상의 주기적 위치 확인
 2) 위치정보수집대상의 날씨 정보 제공
 3) 위치정보수집대상의 이동 궤적 제공
 4) 위치정보수집대상의 운동 데이터 수집 및 통계 서비스

제12조 (정보의 제공)
회사는 서비스를 운영함에 있어 각종 정보를 서비스 공지사항에 게재, 서비스내 알림 또는 전자적 형태 (이메일 등)로 공지하며 전자우편 등의 방법으로 회원에게 제공할 수 있습니다.

제13조 (서비스의 이용)
1. 서비스 이용은 연중무휴 1일 24시간을 원칙으로 합니다.
2. 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상 상당한 이유가 있을 시 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 제9조에 정한 방법으로 회원에게 통지합니다. 다만, 회사가 사전에 통지 불가능할 경우 사후에 통지할 수 있습니다.
3. 회사는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.

제14조 (서비스의 변경)
1. 회사는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 서비스를 변경할 수 있습니다.
2. 서비스의 내용, 이용방법, 이용시간에 대해 변경이 있는 경우 변경사유, 변경될 서비스의 내용 및 제공일자 등은 그 변경 전에 해당 서비스 초기화면에 게시하여야 합니다.
3. 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.

제15조 (정보의 제공)
1. 회사는 회원이 서비스이용 중 필요하다고 인정되는 다양한 정보를 공지사항, 전자우편, 앱 푸쉬 등의 방법으로 회원에 제공할 수 있습니다. 다만 회원은 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있습니다.
2. 회원은 회사가 제공하는 서비스와 관련하여 게시물 또는 기타 정보를 변경, 수정, 제한하는 등의 조치를 취하지 않습니다.

제16조 (게시물의 저작권)
1. 회원이 서비스 내에 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속되어 있으며 회원이 타인의 저작물을 임의로 게시하여 저작권 침해가 발생할 경우, 모든 책임은 회원에게 있습니다.
2. 회원이 서비스 내에 게시하는 게시물은 검색결과 내지 서비스 및 관련 게시판 등에 노출될 수 있으며, 해당 노출을 위해 일부 수정, 복제, 편집될 수 있습니다. 이 경우 회사는 저작권법 규정을 준수하며, 회원은 언제든시 서비스 내 관리기능을 통해 해당 게시물에 대해 삭제 등의 조치를 취할 수 있습니다.
3. 회사는 제2항 이외의 방법으로 회원의 게시물을 이용하고자 할 경우 전화, 팩스, 전자우편 등을 통해 사전에 회원의 동의를 얻어야 합니다.

제17조 (게시물의 관리)
1. 회원의 게시물이 정보통신망법 및 저작권법 등 에 위반되는 내용을 포함할 경우, 권리자는 관련법이 정한 절차에 따라 해당 게시물의 게시중단 및 삭제 등을 요청할 수 있으며, 회사는 관련법에 따라 조치를 취하여야 합니다.
2. 회사는 전항에 따른 권리자의 요청이 없는 경우라도 권리침해가 인정될 만한 사유가 있거나 기타 회사 정책 및 관련법에 위반되는 경우에는 관련법에 따라 해당 게시물에 대해 임시조치 등을 취할 수 있습니다.
3. 회사는 서비스의 효율적 이용 및 운영을 위해 사전 공지 후 “등산로그”의 기록의 일부 또는 전부를 조정할 수 있습니다.

제18조 (권리의 귀속)
1. 회사가 서비스와 관련하여 이용자에게 제공하는 서비스, 애플리케이션, 소프트웨어 기타 일체의 정보 및 자료에 대한 소유권 및 특허권, 저작권 기타 일체의 지식재산권은 회사에 귀속합니다.
2. 이용결과물에 대한 권리는 저작자인 이용자 본인에게 귀속합니다. 한편, 회사는 비상업적 용도에 이용결과물을 자유롭게 이용할 수 있으며, 이용자로부터 별도 동의를 얻어 이용결과물을 상업적 용도에 이용할 수 있습니다.
3. 이용자는 본 약관에서 명시적으로 허용하는 범위 내에서 회사가 제공하는 정보 및 자료 등을 이용할 수 있으며, 서비스 이용과 관련하여 회사의 지식재산권을 침해하여서는 아니 됩니다.

제19조 (이용제한 등)
1. 회사는 이용자가 이 약관의 의무 및 기타 이 약관상 의무를 위반하는 경우, 해당 이용자에 대하여 다음 각 호의 이용제한 조치를 단계적으로 취할 수 있습니다.
가. 시정요구
나. 일시정지
다. 영구이용정지
2. 본 조의 이용제한 조치에 관한 조건 및 세부내용은 회사의 이용제한정책 및 개별 서비스상의 운영정책을 통하여 정합니다.

제20조 (이용제한 및 해제 절차)
1. 회사는 제19조의 규정에 의하여 이용제한을 하고자 하는 경우 그 사유, 일시 및 기간을 정해 이용정지 30일전까지 해당 회원 또는 대리인에게 통지합니다. 다만, 긴급하게 이용을 정지할 필요가 있다고 인정하는 경우에는 그러하지 아니합니다.
2. 제1항의 규정에 의해 이용정지통지를 받은 회원 또는 그 대리인은 그 이용정지의 통지에 대해 이의가 있을 때에는 이의신청이 가능합니다.
3. 회사는 이용정지기간 중에 이용정지 사유가 해소된 것이 확인된 경우에는 이용정지조치를 즉시 해제합니다.


제4장 개인위치정보의 보호
제21조 (개인위치정보의 이용 또는 제공)
회사는 개인위치정보를 이용해 서비스를 제공하고자 하는 경우에는 미리 다음 각호의 내용을 이용약관에 명시한 후 “개인위치정보주체”의 동의를 얻어야 합니다.
1. 회원 및 법정대리인의 권리와 그 행사방법은 제소 당시의 회원의 주소에 의하며, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 “회원”주소 또는 거소가 분명치 않거나 외국거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.
2. 회사는 회원과의 민원처리를 위해 위치정보이용 및 제공, 사실 확인자료를 자동 기록 및 보존하며, 해당 자료는 1년간 보관합니다.
3. 아래 사항에 해당 시, 개인위치정보주체가 미리 지정한 전자우편 또는 온라인 게시 등의 방법으로 통보할 수 있습니다.
 1) 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우
 2) 회원이 개인위치정보를 수집한 해당 통신단말장치 외의 방법으로 통보할 것을 미리 요청한 경우

제22조 (개인위치정보주체의 권리)
1. 회원은 개인위치정보의 이용, 제공목적, 제공받는 자의 범위 및 위치기반서비스의 일부에 대해 동의를 유보하거나 언제든지 동의의 전부 또는 일부를 철회 가능합니다.
2. 회원은 언제든지 개인위치정보의 이용 또는 제공의 일시적인 중지를 요구할 수 있습니다. 이 경우 회사는 요구를 거절하지 아니하며, 이를 위한 기술적 조치를 취합니다.
3. 회원은 회사에 대해 아래 자료의 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 이유 없이 요구를 거절하지 아니합니다.
 1) 본인에 대한 위치정보 이용, 제공사실 확인자료
 2) 개인위치정보주체의 개인위치정보가 위치정보의 보호 및 이용 등에 관한 법률 또는 다른 법률의 규정에 의해 제3자에게 제공된 이유 및 내용
4. 회사는 개인위치정보주체가 위치정보 이용, 제공 에 대한 동의의 전부 또는 일부를 철회한 경우에는 지체 없이 개인위치정보 및 위치정보이용, 제공사실 확인자료(동의의 일부를 철회한 경우에는 철회하는 부분의 확인자료)를 파기합니다.
5. 개인위치정보주체는 제1항 내지 제3항의 권리행사를 위해 회사 소정의 절차를 통해 회사에 요구할 수 있습니다.

제23조 (법정대리인의 권리)
1. 회사는 14세 미만에게는 서비스이용을 원칙적으로 제한하나 법정대리인의 서면 요청이 있는 경우는 예외로 14세 미만의 서비스이용을 허용합니다.
2. 이 경우 회사는 14세 미만의 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의를 당해 회원과 당해 회원의 법정대리인으로부터 동의를 받아야 합니다. 이 경우 법정대리인은 제 22조에 의한 회원의 권리를 모두 가집니다.
3. 회사는 14세 미만의 아동의 개인위치정보 또는 위치정보이용, 제공사실 확인자료를 이용약관에 명시 또는 고지한 범위를 넘어 이용하거나 제3자에게 제공하고자 하는 경우에는 14세미만의 아동과 그 법정대리인의 동의를 받아야 합니다. 단, 아래의 경우는 제외합니다.
 1) 위치정보 및 위치기반서비스 제공에 따른 요금정산을 위해 위치정보이용, 제공사실 확인자료가 필요한 경우
 2) 통계작성, 학술연구 또는 시장조사를 위하여 특정 개인을 알아볼 수 없는 형태로 가공하여 제공하는 경우

제24조 (8세 이하의 아동 등의 보호의무자의 권리)
1. 회사는 아래의 경우에 해당하는 자(이하 “8세 이하의 아동” 등이라 한다)의 보호의무자가 8세 이하의 아동 등의 생명 또는 신체보호를 위하여 개인위치정보의 이용 또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.
 1) 8세 이하의 아동
 2) 금치산자
 3) 장애인복지법제2조제2항제2호의 규정에 의한 정신적 장애를 가진 자로서 장애인고용촉진및직업재활법제2조제2호의 규정에 의한 중증장애인에 해당하는 자
2. 8세 이하의 아동 등의 생명 또는 신체의 보호를 위하여 개인위치정보의 이용 또는 제공에 동의를 하고자 하는 보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여 회사에 제출하여야 합니다.
3. 보호의무자는 8세 이하의 아동 등의 개인위치정보 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의 전부를 행사할 수 있습니다.

제25조 (위치정보관리책임자의 지정)
1. 회사는 위치정보를 적절히 관리, 보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로 지정해 운영합니다.


제5장 계약당사자의 의무
제26조 (회사의 의무)
1. 회사는 이용자에 대한 서비스 제공과 관련하여 관련 법령 및 이 약관, 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적인 서비스 제공을 위하여 최선을 다합니다.
2. 회사는 이용자가 안전하게 서비스를 이용할 수 있도록 이용자의 개인정보를 보호하기 위하여 최선을 다하며, 개인정보처리방침을 공시하고 준수합니다.
3. 회사는 서비스 이용과 관련한 이용자의 불만 또는 피해구제요청을 적절하게 처리할 수 있도록 필요한 인력 및 시스템을 구축 및 유지할 수 있도록 최선을 다합니다.
4. 회사는 서비스 이용과 관련하여 이용자가 정당한 의견 또는 불만을 제기하는 경우, 이를 처리하고 이메일 등을 통하여 이용자에게 그 처리과정 및 결과를 신속하게 전달합니다.

제27조 (이용자의 의무)
1. 이용자는 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 아니 됩니다.
 1) 가입신청 또는 회원정보 변경 시 허위의 내용을 등록하는 행위
 2) 타인의 개인정보, 아이디 및 비밀번호 등 서비스 이용 정보 등을 도용하는 행위
 3) 회사의 사전 승낙 없이 회사가 서비스 상에 게시한 정보를 변경 또는 삭제하는 행위
 4) 회사 및 타인의 지식재산권, 인격권, 명예권 기타 권리를 침해하는 행위
 5) 서비스 정보통신망에 장애를 유발시킬 수 있는 내용의 정보, 문장, 도형 등을 회사가 관리·운영하는 정보통신망에 유포하는 행위
 6) 서비스 운영을 고의로 방해하거나 서비스의 안정적 운영을 방해할 수 있는 정보를 전송하는 행위
 7) 서비스 상의 콘텐츠를 본 약관에 명시된 목적 이외의 용도로 사용하는 행위
 8) 기타 미풍양속에 위반하거나 부당한 행위
2. 이용자는 서비스의 이용과 관련하여 관계 법령, 약관, 세부이용지침, 서비스 이용안내 및 회사가 통지한 공지사항 등을 준수하여야 하며, 기타 회사의 업무를 방해하는 행위를 하여서는 안됩니다.
3. 이용자는 회사의 사전 승낙 없이는 회사가 제공하는 서비스를 이용하여 회사의 영업과 동종의 또는 유사한 영업을 영위할 수 없습니다.
4. 회사는 회사의 사전 승낙 없이 이용자가 행한 제3항의 동종·유사 영업에 대하여 어떠한 책임도 부담하지 않으며, 이용자의 위 영업으로 인하여 회사에게 손해가 발생한 경우 해당 이용자는 회사가 입은 손해를 전액 배상하여야 합니다.
5. 이용자가 본 조의 의무를 위반하는 경우, 회사는 관계법령상 허용되는 범위 내에서 그에 대한 (i) 관련 콘텐츠의 삭제, (ii) 서비스 이용제한 기타 필요한 조치를 취할 수 있습니다.

제28조 (이용자의 계정 정보 관리에 대한 의무 및 책임)
1. 이용자의 계정 정보(이메일 주소, 비밀번호, 닉네임 등을 포함합니다)에 관한 관리책임은 이용자 자신에게 있으며, 이용자는 자신의 계정 정보를 제3자가 이용하도록 하여서는 안됩니다.
2. 이용자는 제3자가 자신의 계정 정보 등 개인정보를 이용하고 있음을 인지한 경우 즉시 비밀번호 등을 변경하고, 회사에 이러한 사실을 통지하고 이후 회사의 안내에 따라야 합니다.
3. 제2항의 경우에 해당 이용자가 회사에게 제3자의 개인정보 이용 사실 등을 통지하지 않거나, 회사의 안내에 따르지 않음에 따라 발생한 불이익에 대하여, 회사는 어떠한 책임도 부담하지 않습니다.

제29조 (권리의 귀속)
1. 회사가 서비스와 관련하여 이용자에게 제공하는 서비스, 애플리케이션, 소프트웨어 기타 일체의 정보 및 자료에 대한 소유권 및 특허권, 저작권 기타 일체의 지식재산권은 회사에 귀속합니다.
2. 이용결과물에 대한 권리는 저작자인 이용자 본인에게 귀속합니다. 한편, 회사는 비상업적 용도에 이용결과물을 자유롭게 이용할 수 있으며, 이용자로부터 별도 동의를 얻어 이용결과물을 상업적 용도에 이용할 수 있습니다.
3. 이용자는 본 약관에서 명시적으로 허용하는 범위 내에서 회사가 제공하는 정보 및 자료 등을 이용할 수 있으며, 서비스 이용과 관련하여 회사의 지식재산권을 침해하여서는 아니 됩니다.


제6장 손해배상
제30조 (손해배상의 범위)
1. 회원은 회사가 위치정보의 보호 및 이용등에 관한 법률 규정의 위반한 행위로 손해를 입게 된 경우 회사에 대해 손해배상청구가 가능합니다. 이 경우 회사는 고의 및 과실이 없음을 입증하지 아니하면 책임을 면할 수 없습니다.
2. 회원은 회원의 의무 등 이 약관의 제규정을 위반함으로써 회사가 입은 일체의 손해에 대하여 이용계약이 해지된 이후에도 배상할 책임이 있습니다.

제31조 (손해배상의 청구)
제30조에 의한 손해배상의 청구는 회사에 청구사유, 청구금액 및 산출근거를 기재하여 서면으로 하여야 합니다.

제32조 (면책)
1. 회사는 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생우려가 있는 경우와 전기통신사업법에 의한 기간통신사업자가 전기통신서비스를 중지하는 등 기타 부득이한 사유가 있는 경우에는 서비스제공에 관한 책임이 면제됩니다.
2. 회사는 제1항의 규정에 의해 서비스이용을 제한하거나 정지한 때에는 그 사유 및 제한기간 등을 이용자에게 지체없이 알리도록 노력해야 합니다.
3. 회사는 회원의 귀책사유로 인한 서비스이용의 장애에 대하여는 책임을 지지 않습니다.
4. 회사는 회원이 서비스와 관련해 게시한 게시물의 정보, 자료, 사실의 신뢰도, 정확성, 저작권 침해 여부 등의 내용에 관하여는 책임을지지 않습니다.
5. 회사는 회원간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 것에 대해 책임을 지지 않습니다.
6. 회사는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을지지 않습니다.
7. 회사는 고객이 회사의 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나 서비스자료에 대한 취소선택 또는 이용으로 발생하는 고객 또는 제3자의 손해 등에 대해서는 책임이 면제됩니다.


제7장 기타
제33조 분쟁
1. 이 약관 및 이용계약에 관한 분쟁은 대한민국 법을 준거법으로 합니다.
2. 약관 및 이용계약에 관하여 회사와 이용자 사이에 발생한 분쟁에 관한 소송은 서울중앙지방법원을 제1심 관할법원으로 하여 해결합니다.

제34조 (회사의 연락처)
회사의 상호 및 문의주소 등은 다음과 같습니다.
1. 상호 : 고고(GOGO)
2. 문의폼 링크 : 구글폼(https://forms.gle/iF39Su1Jy7DDS557A)

부칙
이 약관은 2022년 7월~일부터 시행합니다.`}
    </AuthTermsBase>
  );
};

export default Service;

Service.getLayout = function getLayout(page: ReactElement) {
  return (
    <>
      <Header title="서비스 이용약관" />
      {page}
    </>
  );
};
